Revit 2026 API

# ParameterFilterElementElementFilterIsAcceptableForParameterFilterElement(Document, ISetElementId, ElementFilter) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ElementFilterIsAcceptableForParameterFilterElement(
	Document aDocument,
	ISet<ElementId> categories,
	ElementFilter elementFilter
)
```
```vb
Public Shared Function ElementFilterIsAcceptableForParameterFilterElement (
	aDocument As Document,
	categories As ISet(Of ElementId),
	elementFilter As ElementFilter
) As Boolean
```
```cpp
public:
static bool ElementFilterIsAcceptableForParameterFilterElement(
	Document^ aDocument,
	ISet<ElementId^>^ categories,
	ElementFilter^ elementFilter
)
```
```fsharp
static member ElementFilterIsAcceptableForParameterFilterElement :
        aDocument : Document *
        categories : ISet<ElementId> *
        elementFilter : ElementFilter -> bool
```

#### Parameters

aDocument Document

categories ISetElementId

elementFilter ElementFilter

#### Return Value

Boolean

#### Reference

ParameterFilterElement Class

ElementFilterIsAcceptableForParameterFilterElement Overload

Autodesk.Revit.DB Namespace